API_TOKEN = '7657126359:AAFk5nGrVwsS_6FVl8Dw866k2bOp58lC2ho'
YANDEX_API_KEY = 'YOUR_YANDEX_API_KEY_HERE'

user_profiles = {}

places_by_personality = {
    "Экстраверт": ["Ночные клубы", "Спортивные клубы", "Киберспортивные арены", "Кафе", "Танцевальные студии", "Туристические агентства", "Волонтерские организации"],
    "Интроверт": ["Библиотеки", "Книжные магазины", "Игровые кафе", "Мастерские", "Парки", "Студии йоги", "Музеи"],
    "Амбиверт": ["Квест-комнаты", "Спортивные клубы", "Книжные клубы", "Концертные залы", "Киберспортивные турниры", "Пикниковые зоны", "Мастер-классы"]
}